{
  "backend/main.mo": "Motoko canister managing user profiles, Instagram credential validation, automation settings, and reply logs with access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Global Tailwind-based styles defining light/dark theme tokens and base layout rules.",
  "frontend/index.html": "HTML entry point mounting the React app with a root div and module script.",
  "frontend/src/App.tsx": "Main React app managing authentication, profile initialization, dark theme, and routing between pages.",
  "frontend/src/components/auth/AuthButton.tsx": "Logout button clearing Internet Identity session and query cache.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for new users to create a basic profile with a name field.",
  "frontend/src/components/common/ErrorCallout.tsx": "Reusable error alert component for inline error messages.",
  "frontend/src/components/dashboard/AutomationSettingsSection.tsx": "UI for fetching, editing, and saving keyword-based automation settings.",
  "frontend/src/components/dashboard/ComplianceNotice.tsx": "Notice explaining Instagram API compliance requirements and supported account types.",
  "frontend/src/components/dashboard/InstagramConnectionSection.tsx": "React form to view and validate Instagram credentials, showing connection status and handling validation via mutation.",
  "frontend/src/components/dashboard/LogsSection.tsx": "Displays filtered reply logs with loading states, empty states, and a selectable status filter.",
  "frontend/src/components/layout/DashboardHeader.tsx": "Renders the dashboard header with logo and authentication button.",
  "frontend/src/components/layout/DashboardLayout.tsx": "Provides page layout with header, main content area, and footer including branding link.",
  "frontend/src/hooks/useActor.ts": "Builds and caches an authenticated or anonymous actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, Instagram credentials, automation settings, and reply logs using the actor.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables for theme colors and layout.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Assembles the dashboard view including compliance notice, Instagram connection, automation settings, and logs.",
  "frontend/src/pages/LandingPage.tsx": "React landing page showing branding, feature highlights, and Internet Identity login buttons.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app purpose, architecture, requirements, and implemented features for ReelReply."
}